app/views/insurance_providers/_form.html.erb

  <div class="form-actions">
    <%= f.association :client, label_method: lambda { |c| "#{c.first_name} #{c.last_name}" }, collection: current_user.clients, input_html: { class: 'client_select' }  %>
---
SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = $1  [["user_id", 2]]