app/views/insurance_providers/index.html.erb

      <tr>
        <td><%= provider.client.first_name %></td>
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 ORDER BY "clients"."id" ASC LIMIT 1  [["id", 9]]