app/views/clients/_client.html.erb

	 <td><%= client.last_name %></td>
	 <td><%= client.insurance_providers.order('effective_on DESC').first.copay %></td>
---
SELECT "insurance_providers".* FROM "insurance_providers" WHERE "insurance_providers"."client_id" = $1 ORDER BY effective_on DESC LIMIT 1  [["client_id", 6]]
SELECT MAX("insurance_providers"."effective_on") AS max_id FROM "insurance_providers" WHERE "insurance_providers"."client_id" = $1  [["client_id", 6]]