app/controllers/application_controller.rb

  def index
    if !current_user.nil?
      filter = []
      @my_apps = Appointment.joins(:client).where("user_id = ?", current_user.id)

      if !params[:paid].blank?
        paid = params[:paid]
        filter << ["copay_received = '#{paid.to_s}'"]
      end

      if !params[:effective_on].blank?
        junk = params[:effective_on]
        filter << ["clients.effective_on >= '#{junk.to_s}'"]
      end

      @unpaids = @my_apps.where(filter.join(" AND ")).paginate(page: params[:page])
---
SELECT "appointments".* FROM "appointments" INNER JOIN "clients" ON "clients"."id" = "appointments"."client_id" WHERE (user_id = 2) LIMIT 30 OFFSET 0
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 ORDER BY "clients"."id" ASC LIMIT 1  [["id", 6]]
SELECT COUNT(*) FROM "appointments" INNER JOIN "clients" ON "clients"."id" = "appointments"."client_id" WHERE (user_id = 2)