app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.joins(:client).where("user_id = ?", current_user.id).paginate(page: params[:page])
---
SELECT "appointments".* FROM "appointments" INNER JOIN "clients" ON "clients"."id" = "appointments"."client_id" WHERE (user_id = 2) LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "appointments" INNER JOIN "clients" ON "clients"."id" = "appointments"."client_id" WHERE (user_id = 2)