app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" INNER JOIN "insurance_providers" ON "insurance_providers"."client_id" = "clients"."id" WHERE (insurance_providers.effective_on = (SELECT MAX(effective_on) FROM insurance_providers p group by client_id having p.client_id = insurance_providers.client_id) and user_id = 2) LIMIT 30 OFFSET 0
SELECT COUNT(DISTINCT "clients"."id") FROM "clients" LEFT OUTER JOIN "insurance_providers" ON "insurance_providers"."client_id" = "clients"."id" WHERE (insurance_providers.effective_on = (SELECT MAX(effective_on) FROM insurance_providers p group by client_id having p.client_id = insurance_providers.client_id) and user_id = 2)
---
  def index
    if signed_in?
      @clients = Client.joins(:insurance_providers).where("insurance_providers.effective_on = (SELECT MAX(effective_on) FROM insurance_providers p group by client_id having p.client_id = insurance_providers.client_id) and user_id = ?", current_user.id).paginate(page: params[:page])

INSERT INTO "clients" ("created_at", "first_name", "last_name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 24 Oct 2013 13:46:14 UTC +00:00], ["first_name", "Jerry"], ["last_name", "Mander"], ["updated_at", Thu, 24 Oct 2013 13:46:14 UTC +00:00], ["user_id", 2]]
---
  def create
    if signed_in?

      @client = Client.new(client_params)
      @client.user_id = current_user.id


      respond_to do |format|
        if @client.save