app/controllers/insurance_providers_controller.rb

SELECT "insurance_providers".* FROM "insurance_providers" INNER JOIN "clients" ON "clients"."id" = "insurance_providers"."client_id" WHERE (user_id = 2) ORDER BY client_id DESC
---
  def index
    @insurance_providers = InsuranceProvider.joins(:client).where('user_id = ?', current_user.id).order('client_id DESC')

INSERT INTO "insurance_providers" ("client_id", "copay", "created_at", "effective_on", "member_id", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @insurance_provider = InsuranceProvider.new(insurance_provider_params)

    respond_to do |format|
      if @insurance_provider.save

DELETE FROM "insurance_providers" WHERE "insurance_providers"."id" = $1  [["id", 1]]
---
  def destroy
    @insurance_provider.destroy

SELECT "insurance_providers".* FROM "insurance_providers" WHERE "insurance_providers"."id" = $1 LIMIT 1  [["id", "2"]]
---
    def set_insurance_provider
      @insurance_provider = InsuranceProvider.find(params[:id])