app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    if current_user.admin?
      @users = User.paginate(page: params[:page])

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save