app/views/appointments/_appointment.html.erb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 ORDER BY "clients"."id" ASC LIMIT 1  [["id", 6]]
---
      <tr>
        <td><%= appointment.client.first_name %></td>